/*
 Localized strings for CFErrors returned by AVFoundationCF.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_Description" = "لا يمكن إكمال الإجراء";
"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_RecoverySuggestion" = "حاول مرة أخرى في وقت لاحق.";

"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_Description" = "لا يمكن الفتح";
"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_FailureReason" = "تنسيق هذه الوسائط غير مدعوم.";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_Description" = "لا يمكن الفتح";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_FailureReason" = "قد تكون هذه الوسائط تالفة.";

"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_Description" = "لا يمكن الفتح";
"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_FailureReason" = "هذا التطبيق غير مخول له بتشغيل هذا الملف."; /* the file is DRM protected */
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_Description" = "لا يمكن الفتح";
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_FailureReason" = "لا يمكن استخدام هذه الوسائط.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_Description" = "لا يمكن فك الترميز";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_FailureReason" = "أداة فك الترميز المطلوبة لهذه الوسائط مشغولة.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "قم بإيقاف أي إجراء آخر يقوم بفك ترميز الوسائط ثم حاول مرة أخرى.";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_Description" = "لا يمكن الفتح";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_FailureReason" = "لا يمكن استخدام الوسائط على هذا الكمبيوتر.";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_Description" = "لا يمكن الفتح";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_FailureReason" = "لا يمكن تشغيل المحتوى على شاشة العرض الخارجية.";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_Description" = "لا يمكن الفتح";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_FailureReason" = "لا يمكن تشغيل المحتوى المحمي في تكوين النظام الحالي.";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_Description" = "عدد الإطارات غير صحيح في مسار فيديو إخراج تحويل الترميز";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_FailureReason" = "عدد إطارات إخراج تحويل الترميز غير مساوٍ للمصدر الذي لا يحتوي على أي أقسام تعديل";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_Description" = "فشل فك الترميز";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_FailureReason" = "صادفت أداة فك الترميز خطأ";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_Description" = "فشل الترميز";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_FailureReason" = "صادفت أداة الترميز خطأ";
"AVFoundationCFErrorDomain_AVCFErrorInvalidPersistentKey_Description" = "مفتاح عدم الاتصال المقدم غير صالح";
"AVFoundationCFErrorDomain_AVCFErrorInvalidPersistentKey_FailureReason" = "قد يكون مفتاح عدم الاتصال المقدم غير صالح أو أن دليل تخزين المفاتيح الثابت غير موجود";
"AVFoundationCFErrorDomain_AVCFErrorContentIsNotAuthorized_Description" = "لا يمكن الفتح";
"AVFoundationCFErrorDomain_AVCFErrorContentIsNotAuthorized_FailureReason" = "هذا الكمبيوتر غير مخول بتشغيل المحتوى";
"AVFoundationCFErrorDomain_AVCFErrorApplicationIsNotAuthorized_Description" = "لا يمكن الفتح";
"AVFoundationCFErrorDomain_AVCFErrorApplicationIsNotAuthorized_FailureReason" = "هذا التطبيق غير مخول بتشغيل المحتوى المحمي";
"AVFoundationCFErrorDomain_AVCFErrorContentIsUnavailable_Description" = "لا يمكن الفتح";
"AVFoundationCFErrorDomain_AVCFErrorContentIsUnavailable_FailureReason" = "لم يعد هذا المحتوى متوفرًا";
